Revit 2027 API
AnalyticalToPhysicalAssociationManager.GetAnalyticalToPhysicalAssociationManager Method
 Returns the AnalyticalToPhysicalAssociationManager for this document.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static AnalyticalToPhysicalAssociationManager GetAnalyticalToPhysicalAssociationManager(
	Document doc
)
Public Shared Function GetAnalyticalToPhysicalAssociationManager (
	doc As Document
) As AnalyticalToPhysicalAssociationManager
public:
static AnalyticalToPhysicalAssociationManager^ GetAnalyticalToPhysicalAssociationManager(
	Document^ doc
)
static member GetAnalyticalToPhysicalAssociationManager :
        doc : Document -> AnalyticalToPhysicalAssociationManager
Parameters
doc Document
 Revit document.
Return Value
AnalyticalToPhysicalAssociationManager
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AnalyticalToPhysicalAssociationManager Class
Autodesk.Revit.DB.Structure Namespace